esp8266/Arduino/cores/esp8266/umm_malloc/umm_malloc_cfg.h
/*
 * -D UMM_STATS :
 * -D UMM_STATS_FULL
 *
 * This option provides a lightweight alternative to using `umm_info` just for
 * getting `umm_free_heap_size`.  With this option, a "free blocks" value is
 * updated on each call to malloc/free/realloc. This option does not offer all
 * the information that `umm_info` would have generated.
 *
 * This option is good for cases where the free heap is checked frequently. An
 * example is when an app closely monitors free heap to detect memory leaks. In
 * this case a single-core CPUs interrupt processing would have suffered the
 * most.
 *
 * UMM_STATS_FULL provides additional heap statistics. It can be used to gain
 * additional insight into heap usage. This option would add an additional 132
 * bytes of IRAM.
 *
 * Status: TODO: Needs to be proposed for upstream.
 */
/*
#define UMM_STATS
#define UMM_STATS_FULL
 */

#if !defined(UMM_STATS) && !defined(UMM_STATS_FULL) && !defined(UMM_INLINE_METRICS)
#define UMM_STATS
#endif

#if defined(UMM_STATS) && defined(UMM_STATS_FULL)
#undef UMM_STATS
#endif

#if defined(UMM_STATS) || defined(UMM_STATS_FULL)

typedef struct UMM_STATISTICS_t {
#ifndef UMM_INLINE_METRICS
// If we are doing UMM_INLINE_METRICS, we can move oom_count and free_blocks to
// umm_info's structure and save a little DRAM and IRAM.
// Otherwise it is defined here.
  size_t free_blocks;
  size_t oom_count;
  #define UMM_OOM_COUNT ummStats.oom_count
  #define UMM_FREE_BLOCKS ummStats.free_blocks
#endif
#ifdef UMM_STATS_FULL
  size_t free_blocks_min;
  size_t free_blocks_isr_min;
  size_t alloc_max_size;
  size_t last_alloc_size;
  size_t id_malloc_count;
  size_t id_malloc_zero_count;
  size_t id_realloc_count;
  size_t id_realloc_zero_count;
  size_t id_free_count;
  size_t id_free_null_count;
#endif
}
UMM_STATISTICS;
extern UMM_STATISTICS ummStats;

#ifdef UMM_INLINE_METRICS
#define STATS__FREE_BLOCKS_UPDATE(s) (void)(s)
#else
#define STATS__FREE_BLOCKS_UPDATE(s) ummStats.free_blocks += (s)
#endif

#define STATS__OOM_UPDATE() UMM_OOM_COUNT += 1

extern size_t umm_free_heap_size_lw( void );

static inline size_t ICACHE_FLASH_ATTR umm_get_oom_count( void ) {
  return UMM_OOM_COUNT;
}

#else  // not UMM_STATS or UMM_STATS_FULL
#define STATS__FREE_BLOCKS_UPDATE(s) (void)(s)
#define STATS__OOM_UPDATE()          (void)0
#endif

#if defined(UMM_STATS) || defined(UMM_STATS_FULL) || defined(UMM_INFO)
size_t ICACHE_FLASH_ATTR umm_block_size( void );
#endif

#ifdef UMM_STATS_FULL
#define STATS__FREE_BLOCKS_MIN() \
do { \
    if (UMM_FREE_BLOCKS < ummStats.free_blocks_min) \
        ummStats.free_blocks_min = UMM_FREE_BLOCKS; \
} while(false)

#define STATS__FREE_BLOCKS_ISR_MIN() \
do { \
    if (UMM_FREE_BLOCKS < ummStats.free_blocks_isr_min) \
        ummStats.free_blocks_isr_min = UMM_FREE_BLOCKS; \
} while(false)

#define STATS__ALLOC_REQUEST(tag, s)  \
do { \
    ummStats.tag##_count += 1; \
    ummStats.last_alloc_size = s; \
    if (ummStats.alloc_max_size < s) \
        ummStats.alloc_max_size = s; \
} while(false)

#define STATS__ZERO_ALLOC_REQUEST(tag, s)  \
do { \
    ummStats.tag##_zero_count += 1; \
} while(false)

#define STATS__NULL_FREE_REQUEST(tag)  \
do { \
    ummStats.tag##_null_count += 1; \
} while(false)

#define STATS__FREE_REQUEST(tag)  \
do { \
    ummStats.tag##_count += 1; \
} while(false)

static inline size_t ICACHE_FLASH_ATTR umm_free_heap_size_lw_min( void ) {
  return (size_t)ummStats.free_blocks_min * umm_block_size();
}

static inline size_t ICACHE_FLASH_ATTR umm_free_heap_size_min_reset( void ) {
  ummStats.free_blocks_min = UMM_FREE_BLOCKS;
  return (size_t)ummStats.free_blocks_min * umm_block_size();
}

static inline size_t ICACHE_FLASH_ATTR umm_free_heap_size_min( void ) {
  return ummStats.free_blocks_min * umm_block_size();
}

static inline size_t ICACHE_FLASH_ATTR umm_free_heap_size_isr_min( void ) {
  return ummStats.free_blocks_isr_min * umm_block_size();
}

static inline size_t ICACHE_FLASH_ATTR umm_get_max_alloc_size( void ) {
  return ummStats.alloc_max_size;
}

static inline size_t ICACHE_FLASH_ATTR umm_get_last_alloc_size( void ) {
  return ummStats.last_alloc_size;
}

static inline size_t ICACHE_FLASH_ATTR umm_get_malloc_count( void ) {
  return ummStats.id_malloc_count;
}

static inline size_t ICACHE_FLASH_ATTR umm_get_malloc_zero_count( void ) {
  return ummStats.id_malloc_zero_count;
}

static inline size_t ICACHE_FLASH_ATTR umm_get_realloc_count( void ) {
  return ummStats.id_realloc_count;
}

static inline size_t ICACHE_FLASH_ATTR umm_get_realloc_zero_count( void ) {
  return ummStats.id_realloc_zero_count;
}

static inline size_t ICACHE_FLASH_ATTR umm_get_free_count( void ) {
  return ummStats.id_free_count;
}

static inline size_t ICACHE_FLASH_ATTR umm_get_free_null_count( void ) {
  return ummStats.id_free_null_count;
}

#else // Not UMM_STATS_FULL
#define STATS__FREE_BLOCKS_MIN()          (void)0
#define STATS__FREE_BLOCKS_ISR_MIN()      (void)0
#define STATS__ALLOC_REQUEST(tag, s)      (void)(s)
#define STATS__ZERO_ALLOC_REQUEST(tag, s) (void)(s)
#define STATS__NULL_FREE_REQUEST(tag)     (void)0
#define STATS__FREE_REQUEST(tag)          (void)0
#endif

/*
  Per Devyte, the core currently doesn't support masking a specific interrupt
  level. That doesn't mean it can't be implemented, only that at this time
  locking is implemented as all or nothing.
  https://github.com/esp8266/Arduino/issues/6246#issuecomment-508612609

  So for now we default to all, 15.
 */
#ifndef DEFAULT_CRITICAL_SECTION_INTLEVEL
#define DEFAULT_CRITICAL_SECTION_INTLEVEL 15
#endif

/*
 * -D UMM_CRITICAL_METRICS
 *
 * Build option to collect timing usage data on critical section usage in
 * functions: info, malloc, realloc. Collects MIN, MAX, and number of time IRQs
 * were disabled at request time. Note, for realloc MAX disabled time will
 * include the time spent in calling malloc and/or free. Examine code for
 * specifics on what info is available and how to access.
 *
 * Status: TODO: Needs to be proposed for upstream. Also should include updates
 * to UMM_POISON_CHECK and UMM_INTEGRITY_CHECK to include a critical section.
 */
/*
#define UMM_CRITICAL_METRICS
 */

#if defined(UMM_CRITICAL_METRICS)
// This option adds support for gathering time locked data

typedef struct UMM_TIME_STAT_t {
  uint32_t min;
  uint32_t max;
  uint32_t start;
  uint32_t intlevel;
}
UMM_TIME_STAT;

